## create a dataframe

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import datetime as dt
%matplotlib inline

### creat a Pandas Serial from a list

In [2]:
lst = ['aaa','bbb','ccc','ccc']
ser = pd.Series(lst)

### Create a DateFrame

In [3]:
dates = pd.date_range('20130101', periods=6)
df1 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df1

                   A         B         C         D
2013-01-01  1.495109 -0.306588  1.774043  1.800057
2013-01-02 -0.157088 -1.041997  0.087161  0.233549
2013-01-03 -0.834118  0.076192  0.560191  0.240536
2013-01-04 -0.690607  1.887286  0.137204  1.289319
2013-01-05 -1.711651 -1.235900  0.508003 -1.963408
2013-01-06 -0.592492  0.525651  1.748502 -0.559657

### Create a DataFrame from Dict and specify index column

In [4]:
index_1 = [1000,2000,3000,4000]
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' },
                  index=index_1)
df2

        A          B   C  D      E    F
1000  1.0 2013-01-02 NaN  3   test  foo
2000  1.0 2013-01-02 NaN  3  train  foo
3000  1.0 2013-01-02 NaN  3   test  foo
4000  1.0 2013-01-02 NaN  3  train  foo

### Create a DF  from Dict

In [5]:
df3 = pd.DataFrame({'Name': 'Name',
                    'age': np.arange(0,10,2),
                    'Date': pd.Timestamp(dt.datetime.now())})

In [6]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df3.columns

Index(['Date', 'Name', 'age'], dtype='object')

In [8]:
df3.T

,0,1,2,3,4
Date,2017-11-25 00:53:49.680127,2017-11-25 00:53:49.680127,2017-11-25 00:53:49.680127,2017-11-25 00:53:49.680127,2017-11-25 00:53:49.680127
Name,Name,Name,Name,Name,Name
age,0,2,4,6,8

In [9]:
df3.describe()

            age
count  5.000000
mean   4.000000
std    3.162278
min    0.000000
25%    2.000000
50%    4.000000
75%    6.000000
max    8.000000

In [10]:
df1

                   A         B         C         D
2013-01-01  1.495109 -0.306588  1.774043  1.800057
2013-01-02 -0.157088 -1.041997  0.087161  0.233549
2013-01-03 -0.834118  0.076192  0.560191  0.240536
2013-01-04 -0.690607  1.887286  0.137204  1.289319
2013-01-05 -1.711651 -1.235900  0.508003 -1.963408
2013-01-06 -0.592492  0.525651  1.748502 -0.559657

In [11]:
df1.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -0.592492  0.525651  1.748502 -0.559657
2013-01-05 -1.711651 -1.235900  0.508003 -1.963408
2013-01-04 -0.690607  1.887286  0.137204  1.289319
2013-01-03 -0.834118  0.076192  0.560191  0.240536
2013-01-02 -0.157088 -1.041997  0.087161  0.233549
2013-01-01  1.495109 -0.306588  1.774043  1.800057

In [12]:
df1.sort_values(by='D')

                   A         B         C         D
2013-01-05 -1.711651 -1.235900  0.508003 -1.963408
2013-01-06 -0.592492  0.525651  1.748502 -0.559657
2013-01-02 -0.157088 -1.041997  0.087161  0.233549
2013-01-03 -0.834118  0.076192  0.560191  0.240536
2013-01-04 -0.690607  1.887286  0.137204  1.289319
2013-01-01  1.495109 -0.306588  1.774043  1.800057

In [13]:
df1.loc[dates[1]:dates[2], ['C','D']]

                   C         D
2013-01-02  0.087161  0.233549
2013-01-03  0.560191  0.240536

In [14]:
df11 = df1.copy()
df11['E'] = ['one','two','three','four','five','six']
df11.iloc[2:3,2:3] = np.abs(df11.iloc[2,2])
df11.iloc[2:4,2:4]
Bools = df11['E'].isin(['one','four'])

In [15]:
df11[Bools]

                   A         B         C         D     E
2013-01-01  1.495109 -0.306588  1.774043  1.800057   one
2013-01-04 -0.690607  1.887286  0.137204  1.289319  four

In [16]:
df11

                   A         B         C         D      E
2013-01-01  1.495109 -0.306588  1.774043  1.800057    one
2013-01-02 -0.157088 -1.041997  0.087161  0.233549    two
2013-01-03 -0.834118  0.076192  0.560191  0.240536  three
2013-01-04 -0.690607  1.887286  0.137204  1.289319   four
2013-01-05 -1.711651 -1.235900  0.508003 -1.963408   five
2013-01-06 -0.592492  0.525651  1.748502 -0.559657    six

In [17]:
df111 = df11.iloc[0:2,2:4].copy()
df111

                   C         D
2013-01-01  1.774043  1.800057
2013-01-02  0.087161  0.233549

In [18]:
df11.mean(axis=0)

A   -0.415141
B   -0.015893
C    0.802517
D    0.173399
dtype: float64

In [19]:
pd.concat([df11[:3], df11[2:4]])

                   A         B         C         D      E
2013-01-01  1.495109 -0.306588  1.774043  1.800057    one
2013-01-02 -0.157088 -1.041997  0.087161  0.233549    two
2013-01-03 -0.834118  0.076192  0.560191  0.240536  three
2013-01-03 -0.834118  0.076192  0.560191  0.240536  three
2013-01-04 -0.690607  1.887286  0.137204  1.289319   four

In [ ]:
pd.soft_values